In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [7]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
#Ans:
import pandas as pd
data = [4,8,15,16,23,42]
ser = pd.Series(data)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
type(ser)

pandas.core.series.Series

In [8]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.
#Ans:
l = [1,2,3.45,4.77785,"dipta",6,"chakra",8,9,10]
pd.Series(l)

0          1
1          2
2       3.45
3    4.77785
4      dipta
5          6
6     chakra
7          8
8          9
9         10
dtype: object

In [10]:
#Q3
#Ans:
import pandas as pd

data = {'Name': ['Alice', 'Rob','Claire'],

        'Age': [25, 30, 27],

        'Gender': ['Female', 'Male', 'Female']}

df = pd.DataFrame(data)

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Rob   30    Male
2  Claire   27  Female

In [15]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
#Ans:
#1.Pandas series is one dimensional whereas Pandas Dataframe is two dimensional.
#2.Pandas series is Homogeneous i.e  Series elements must be of the same data type. but Pandas Dataframe is heterogeneous i.e. DataFrame elements can have different data types.
#3. Once pandas series is created ,the size of the series object cannot be changd i.e. it is Size-immutable but Elements can be dropped or added in an existing DataFrame. i.e Pands Datframe is size mutable
#Example of dataframe in pandas is 
data = {
    "Class 1": [22, 33, 38],
    "Class 2": [45, 28, 36], 
    "Class 3": [32, 41, 47]
}
df1 = pd.DataFrame(data=data, index=['math avg', 'science avg', 'english avg'])
df1

             Class 1  Class 2  Class 3
math avg          22       45       32
science avg       33       28       41
english avg       38       36       47

In [20]:
#Example of dataframe in pandas is 
#Creating a Series from dict
data = {'1': 22, '2':"dipta", '3': 23, '4': "babai", '5': 23, '6': 22, '7': 21}
series = pd.Series(data)
print(series)

1       22
2    dipta
3       23
4    babai
5       23
6       22
7       21
dtype: object

In [22]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
#Ans:Some common functions we can use to manipulate data in a Pandas DataFrame are 1.map(), 2.apply(), 3.applymap()

#map() is used for apply a function to a Series.
#apply() is used for  apply a function to a Series or Dataframe 
#applymap() is used for apply a function to a Dataframe element-wise.

In [26]:
import pandas as pd

df = pd.DataFrame(
    [('Prem', 14, "M"), 
     ('Chand', 16, "M"),
     ('Archana', 18, "F"), 
     ('Chandrani', 20, "F"),
     ('DIptajit', 21, "M")
    ], 
    columns=['Name', 'age', 'gender']
)
df

mappings = {
    'Prem': 'Ram',
    'Chand': 'Chumki',
    'Archana': 'Chinmay',
    'Chandrani': 'Sunil',
    'Diptajit': 'Shiva'
}

df['parents name'] = df['Name'].map(mappings)
df

        Name  age gender parents name
0       Prem   14      M          Ram
1      Chand   16      M       Chumki
2    Archana   18      F      Chinmay
3  Chandrani   20      F        Sunil
4   DIptajit   21      M          NaN

In [27]:
#Example of apply()
import pandas as pd

df = pd.DataFrame({'A': [1, 2], 'B': [10, 20]})


def cube(x):
    return x * x * x


df1 = df.apply(cube)

print(df)
print(df1)

   A   B
0  1  10
1  2  20
   A     B
0  1  1000
1  8  8000

In [31]:
import pandas as pd

def up(x):
    
    return x.upper()

data = {
  "name": ["Sirdaz","Palli","Aryan"],
  "city": ["Italy", "USA", "Dwarka"]
}

df = pd.DataFrame(data)

newdf = df.applymap(up)

print(newdf)

     name    city
0  SIRDAZ   ITALY
1   PALLI     USA
2   ARYAN  DWARKA

In [30]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
#ANs:DataFrame

In [33]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.
#Ans:
import pandas as pd
courses = pd.Series(["Data science","Web Dev","Java"])
fees = pd.Series([3500,3800,3200])
time_bound  = pd.Series(["2 yars","1.9 years","2.1years"])
df=pd.concat([courses,fees,time_bound],axis=1)
print(df)

              0     1          2
0  Data science  3500     2 yars
1       Web Dev  3800  1.9 years
2          Java  3200   2.1years